"""
Содержит параметры для оформления единой стилизации,
которые импортируются в остальные модули и включает:

- Имена фоновых цветов

- Имена пользовательских стилей для ttk



"""

# Наименование используемого стиля
STYLE_THEME_USE = 'clam'  # default / alt


# Общий цвет фона для TFrame
FRAME_BG = '#f0f0f0'  # Светло-серый

# Цвет фона для активной кнопки главного меню
BUTTON_BG_ACTIVE = '#A9A9A9'  # Темно-серый


# Наименование стиля для кнопки главного меню
BUTTON_MAIN_MENU = 'main_menu.TButton'
# Наименование стиля для кнопки управления
BUTTON_CONTROL = 'control.TButton'
# Наименование стиля кнопки фильтров при наличии фильтра
BUTTON_FILTER = 'filter.TButton'

# Наименование стиля для метки-подписи используемой для текстовых полей
LABEL_CAPTION = 'caption_for_text.TLabel'

# Наименования стиля для галочки
CHECKBUTTON_STYLE = 'checkbutton_style.TCheckbutton'